Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroupAttributes Properties
The ReinforcementBase.ReinforcementSetGroupAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HiddenLines
 The line type of the hidden lines of the reinforcement.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HideLinesHiddenByPart
 Defines whether lines hidden by parts should be hidden or not.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HideLinesHiddenByReinforcement
 Defines whether lines hidden by reinforcements should be hidden or not.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
HookedEndSymbolType
 Gets or sets how the hooked ends of reinforcing bars should look like.
ReinforcementRepresentation
 The representation of reinforcing bars.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
ReinforcementVisibility
 Gets or sets which bars in the group appear in drawings.
StraightEndSymbolType
 Gets or sets how the straight ends of reinforcing bars should look like.
VisibleLines
 The line type of the visible lines of the reinforcement.
 (Inherited from ReinforcementBase.ReinforcementBaseAttributes.)
Top
See Also
Reference
ReinforcementBase.ReinforcementSetGroupAttributes Class
Tekla.Structures.Drawing Namespace